[{"ls_id":1, "ls_title":"Running", "ls_url_title":"running", "ls_meta_title":"A Good Run can do Amazing Things for You, Run and Stay Fit", "ls_meta_desc":"\"It is often said that run often and run long. Running can make you healthy, happy and content. While it rejuvenates the mind and body, it does wonders to your physical health. We believe that you have a right to stay fit; therefore here we have everything that you need to know about running.\"", "ls_category_col_2":"weight-loss", "ls_category_col_3":"garlic", "ls_display_items_with_order":""},
 {"ls_id":2, "ls_title":"Weight Loss", "ls_url_title":"weight-loss", "ls_meta_title":"Lose weight, Become Healthy and Look Glamorous", "ls_meta_desc":"\"Losing weight, burn fat and build lean muscle mass the right way. Optimum weight and health can be achieved by adopting better lifestyle habits. We believe that you have a right to stay fit; therefore here we have everything that you need to know to healthy living.\"", "ls_category_col_2":"running", "ls_category_col_3":"garlic", "ls_display_items_with_order":""},
 {"ls_id":3, "ls_title":"Garlic", "ls_url_title":"garlic", "ls_meta_title":"Garlic is a Miracle Herb with Myriad of Health Benefits", "ls_meta_desc":"\"Garlic has been used around the world for thousands of years as a healing food. Latest medical research indicates garlic may prevent and even reverse serious conditions like, hypertension, diabetes, cancer, etc. Recent research also suggests that garlic has amazing anti-aging properties. No doubt it is called a Wonder Drug.\"", "ls_category_col_2":"turmeric", "ls_category_col_3":"weight-loss", "ls_display_items_with_order":""},
 {"ls_id":4, "ls_title":"Turmeric", "ls_url_title":"turmeric", "ls_meta_title":"Turmeric is a Miracle Herb with Myriad of Health Benefits", "ls_meta_desc":"\"Turmeric (a.k.a Haldi) has been used in ayurveda for thousands of years. Ayurveda is an age-old medicinal system, and turmeric has been an important ingredient in treating different types of ailments.\"", "ls_category_col_2":"garlic", "ls_category_col_3":"weight-loss", "ls_display_items_with_order":""},
 {"ls_id":5, "ls_title":"Herbs", "ls_url_title":"herbs", "ls_meta_title":"Benefits of herbs. Heal your self naturally with herbs.", "ls_meta_desc":"\"Benefits of herbs. Heal your self naturally with herbs.\"", "ls_category_col_2":"running", "ls_category_col_3":"weight-loss", "ls_display_items_with_order":"41, 32, 42, 34, 43, 35, 44, 33, 45, 37, 46, 40, 31"}]